# IsSplitHorizontally Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewCropRegionShapeManager..::..IsSplitHorizontally Property
ViewCropRegionShapeManager Class See Also
---
Whether or not the view's crop is split (and the split is horizontal).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsSplitHorizontally { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSplitHorizontally As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSplitHorizontally {
	bool get ();
}
```

# See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace